Импортируйте библиотеку Pandas и дайте ей псевдоним pd.

In [2]:
import pandas as pd
import numpy as np

Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

In [3]:
author_name = pd.Series(['Тургенев', 'Чехов', 'Островский'], index=[1, 2, 3])
author_id = pd.Series([1, 2, 3], index=[1, 2, 3])
print(author_name, '\n', author_id)

1      Тургенев
2         Чехов
3    Островский
dtype: object
 1    1
2    2
3    3
dtype: int64

In [4]:
authors = pd.DataFrame({'author_id':author_id, 'author_name': author_name})
authors

   author_id author_name
1          1    Тургенев
2          2       Чехов
3          3  Островский

Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники']

In [5]:
idx = pd.Index([1, 2, 3, 4, 5, 6, 7])
author_id = pd.Series([1, 1, 1, 2, 2, 3, 3], index=idx)
book_title = pd.Series(['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                        'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], index=idx)
price = pd.Series([1000, 1200, 800, 950, 300, 2000, 1300], index=idx)

book = pd.DataFrame({'author_id': author_id, 'book_title': book_title, 'price': price})
book

   author_id            book_title  price
1          1           Отцы и дети   1000
2          1                 Рудин   1200
3          1     Дворянское гнездо    800
4          2      Толстый и тонкий    950
5          2       Дама с собачкой    300
6          3                 Гроза   2000
7          3  Таланты и поклонники   1300

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [6]:
authors_price = pd.merge(authors, book)
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети   1000
1          1    Тургенев                 Рудин   1200
2          1    Тургенев     Дворянское гнездо    800
3          2       Чехов      Толстый и тонкий    950
4          2       Чехов       Дама с собачкой    300
5          3  Островский                 Гроза   2000
6          3  Островский  Таланты и поклонники   1300

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [7]:
top5 = authors_price.sort_values('price', ascending=False).head(5)
top5

   author_id author_name            book_title  price
5          3  Островский                 Гроза   2000
6          3  Островский  Таланты и поклонники   1300
1          1    Тургенев                 Рудин   1200
0          1    Тургенев           Отцы и дети   1000
3          2       Чехов      Толстый и тонкий    950

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [8]:
authors_stat1 = authors_price.loc[authors_price.author_id == 1, ['author_name', 'price']]
authors_stat2 = authors_price.loc[authors_price.author_id == 2, ['author_name', 'price']]
authors_stat3 = authors_price.loc[authors_price.author_id == 3, ['author_name', 'price']]

authors_stat1['min_price'] = authors_stat1.price.min()
authors_stat1['max_price'] = authors_stat1.price.max()
authors_stat1['mean_price'] = authors_stat1.price.mean()

authors_stat2['min_price'] = authors_stat2.price.min()
authors_stat2['max_price'] = authors_stat2.price.max()
authors_stat2['mean_price'] = authors_stat2.price.mean()

authors_stat3['min_price'] = authors_stat3.price.min()
authors_stat3['max_price'] = authors_stat3.price.max()
authors_stat3['mean_price'] = authors_stat3.price.mean()

authors_stat = pd.concat([authors_stat1, authors_stat2, authors_stat3])
authors_stat = authors_stat.drop(['price'], axis=1)
authors_stat = authors_stat.drop([0, 2, 3, 6], axis=0)
authors_stat.index = [0, 1, 2]
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        800       1200        1000
1       Чехов        300        950         625
2  Островский       1300       2000        1650

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

In [10]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети   1000  твердая
1          1    Тургенев                 Рудин   1200   мягкая
2          1    Тургенев     Дворянское гнездо    800   мягкая
3          2       Чехов      Толстый и тонкий    950  твердая
4          2       Чехов       Дама с собачкой    300  твердая
5          3  Островский                 Гроза   2000   мягкая
6          3  Островский  Таланты и поклонники   1300   мягкая

Просмотрите документацию по функции pd.pivot table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

In [20]:
authors_price.groupby(['author_name', 'cover'])['price'].sum()

author_name  cover
Островский   мягкая     3300
Тургенев     мягкая     2000
             твердая    1000
Чехов        твердая    1250
Name: price, dtype: int64

In [27]:
authors_price.pivot_table('price', index='author_name', columns='cover', aggfunc='sum', fill_value=0)

cover        мягкая  твердая
author_name
Островский     3300        0
Тургенев       2000     1000
Чехов             0     1250